tap "homebrew/bundle"

# Core CLI
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "zoxide"
brew "tmux"
brew "starship"
brew "direnv"
brew "tree"
brew "htop"
brew "tldr"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Dev tooling
brew "mise"
brew "git-delta"       # better git diffs

# Casks
cask "ghostty"
